//;******************************************************************************
//;* Copyright (c) 1983-2013, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

/=#


#string STR_POST_MESSAGE_TITLE                                            #language en-US "POST Message Setting"
#string STR_LOG_ONLY_TEXT                                                  #language en-US "Log Only"
#string STR_DISPLAY_ONLY_TEXT                                              #language en-US "Display Only"
#string STR_LOG_AND_DISPLAY_TEXT                                           #language en-US "Log and Display"
#string STR_BEEP_ONLY_TEXT                                                 #language en-US "Beep Only"
//
// POST Message.
//
#string STR_POST_MESSAGE_CONFIG_STRING                                    #language en-US "POST Message Configuration"
#string STR_POST_MESSAGE_CONFIG_HELP                                      #language en-US "Enable / Disable the POST message settings."

#string STR_PROGRESS_CODE_MESSAGE_STRING                                   #language en-US " Progress Code"
#string STR_PROGRESS_CODE_MESSAGE_HELP                                     #language en-US "Progress Code Messages are enabled in the BIOS, Progress Code Messages are disabled in the BIOS"

#string STR_ERROR_CODE_MESSAGE_STRING                                      #language en-US " Error Code"
#string STR_ERROR_CODE_MESSAGE_HELP                                        #language en-US "Error Code Messages are enabled in the BIOS, Error Code Messages are disabled in the BIOS"

#string STR_DEBUG_CODE_MESSAGE_STRING                                      #language en-US " Debug Code"
#string STR_DEBUG_CODE_MESSAGE_HELP                                        #language en-US "Debug Code Messages are enabled in the BIOS, Debug Code Messages are disabled in the BIOS"

#string STR_LOG_POST_MESSAGE_STRING                                       #language en-US " Log POST Message"
#string STR_LOG_POST_MESSAGE_HELP                                         #language en-US "Enabled - POST Message will be logged to BIOS GPNV, BMC SEL or others event storage. Disabled- Don't log any POST Message"
#string STR_SHOW_POST_MESSAGE_STRING                                      #language en-US " Show POST Message"
#string STR_SHOW_POST_MESSAGE_HELP                                        #language en-US "Enabled - POST Message will show on screen after VGA is active. Disabled- Don't show any POST Message"
#string STR_BEEP_POST_MESSAGE_STRING                                      #language en-US " Beep POST Message"
#string STR_BEEP_POST_MESSAGE_HELP                                        #language en-US "Enabled - POST Message will generate beep sound. Disabled- Don't beep any POST Message"
//
// End of file
//